Hummus/app/controllers/images_controller.rb

    def index
        @images = Image.all
---
SELECT `images`.* FROM `images`

    def create
        @image = Image.new(image_params)

        respond_to do |format|
            if @image.save
---
INSERT INTO `images` (`picture_file_name`, `picture_content_type`, `picture_file_size`, `picture_updated_at`) VALUES ('Recipes.png', 'image/png', 166725, '2016-04-12 17:40:05')

    def set_image
        @image = Image.find(params[:id])
---
SELECT  `images`.* FROM `images` WHERE `images`.`id` = 1 LIMIT 1