Hummus/app/controllers/recipe_controller.rb

   def admin
    @recipes = Recipe.all
---
SELECT `recipes`.* FROM `recipes`

   def list
    @recipes = Recipe.all
---
SELECT `recipes`.* FROM `recipes`

   def show
     @recipe = Recipe.find(params[:id])
     @image = Image.find(params[:imageId])
---
SELECT  `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 0 LIMIT 1
SELECT  `images`.* FROM `images` WHERE `images`.`id` = 1 LIMIT 1

   def show_admin
       @recipe = Recipe.find(params[:id])
       @image = Image.find(params[:imageId])
---
SELECT  `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 22 LIMIT 1
SELECT  `images`.* FROM `images` WHERE `images`.`id` = 2 LIMIT 1

   def new
       @recipe = Recipe.new
       @images = Image.all
---
SELECT `images`.* FROM `images`

   def create
     @recipe = Recipe.new(recipe_params)

     if @recipe.save
---
INSERT INTO `recipes` (`name`, `instructions`, `ingredients`, `made`) VALUES ('recipe5', 'instructions5', 'ingredients5', 0)

   def edit
     @recipe = Recipe.find(params[:id])
---
SELECT  `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 3 LIMIT 1

   def update
     @recipe = Recipe.find(params[:id])

       if @recipe.update_attributes(recipe_param)
---
SELECT  `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 3 LIMIT 1
UPDATE `recipes` SET `name` = 'recipe5a', `instructions` = 'instructions5a', `ingredients` = 'ingredients5a', `made` = 1 WHERE `recipes`.`id` = 3

   def delete
     Recipe.find(params[:id]).destroy
---
DELETE FROM `recipes` WHERE `recipes`.`id` = 2
SELECT  `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 2 LIMIT 1